{"format": "graph-model", "generatedBy": "2.10.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"image": {"name": "image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "155"}, {"size": "50"}, {"size": "1"}]}}, "label": {"name": "label:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"ctc_loss": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "38"}, {"size": "11"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "11"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/Conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/Conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/Conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/Conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "image", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "155"}, {"size": "50"}, {"size": "1"}]}}}}, {"name": "label", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_243", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_244", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_245", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_237", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_235", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_303", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_304", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_305", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_297", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_123", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvZm9yd2FyZF9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_124", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvZm9yd2FyZF9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_125", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvZm9yd2FyZF9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_117", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvZm9yd2FyZF9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_115", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvZm9yd2FyZF9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_183", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvYmFja3dhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_184", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvYmFja3dhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_185", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvYmFja3dhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_177", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvYmFja3dhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_175", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWwvYmFja3dhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_295", "op": "Enter", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb2NyX21vZGVsX3YxL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/Conv1/Relu", "op": "_FusedConv2D", "input": ["image", "StatefulPartitionedCall/ocr_model_v1/Conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ocr_model_v1/Conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_254", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_243", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_290"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_255", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_244", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_291"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_256", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_245", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_292"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_248", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_237", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_284"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_246", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_235", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_282"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_314", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_303", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_350"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_315", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_304", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_351"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_316", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_305", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_352"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_308", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_297", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_344"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/merge/_134", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_123", "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_170"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_124", "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_171"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/merge/_136", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_125", "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_172"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/merge/_128", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_117", "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_164"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/merge/_126", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/enter/_115", "StatefulPartitionedCall/ocr_model_v1/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_162"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/merge/_194", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_183", "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_230"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/merge/_195", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_184", "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_231"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/merge/_196", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_185", "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_232"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/merge/_188", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_177", "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_224"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/merge/_186", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/enter/_175", "StatefulPartitionedCall/ocr_model_v1/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_222"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_306", "op": "Merge", "input": ["StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_295", "StatefulPartitionedCall/ocr_model_v1/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_342"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/pool1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ocr_model_v1/Conv1/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/Conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ocr_model_v1/pool1/MaxPool", "StatefulPartitionedCall/ocr_model_v1/Conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ocr_model_v1/Conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/pool2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ocr_model_v1/Conv2/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/ocr_model_v1/pool2/MaxPool"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/ocr_model_v1/reshape/Shape", "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice/stack", "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice/stack_1", "StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/ocr_model_v1/reshape/strided_slice", "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape/shape/1", "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/ocr_model_v1/pool2/MaxPool", "StatefulPartitionedCall/ocr_model_v1/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/ocr_model_v1/reshape/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/Shape", "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/axes", "StatefulPartitionedCall/ocr_model_v1/dense1/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": 